In [2]:
import pandas as pd
df=pd.read_csv("titanic_train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
inputs = df[["Pclass","Sex","Age","Fare","Survived"]]
inputs.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [5]:
targets = df.Survived

In [13]:
newip= inputs.drop("Survived", axis="columns")

In [14]:
dummies = pd.get_dummies(inputs.Sex)

In [15]:
inputs=pd.concat([inputs,dummies], axis='columns')

In [16]:
inputs.head()

   Pclass     Sex   Age     Fare  Survived  female  male  female  male
0       3    male  22.0   7.2500         0       0     1       0     1
1       1  female  38.0  71.2833         1       1     0       1     0
2       3  female  26.0   7.9250         1       1     0       1     0
3       1  female  35.0  53.1000         1       1     0       1     0
4       3    male  35.0   8.0500         0       0     1       0     1

In [17]:
newip.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [18]:
newip = newip.drop('Sex', axis = 'columns')

In [19]:
newip

     Pclass   Age     Fare  female  male
0         3  22.0   7.2500       0     1
1         1  38.0  71.2833       1     0
2         3  26.0   7.9250       1     0
3         1  35.0  53.1000       1     0
4         3  35.0   8.0500       0     1
..      ...   ...      ...     ...   ...
886       2  27.0  13.0000       0     1
887       1  19.0  30.0000       1     0
888       3   NaN  23.4500       1     0
889       1  26.0  30.0000       0     1
890       3  32.0   7.7500       0     1

[891 rows x 5 columns]

In [21]:
newip.columns[newip.isnull().any()]

Index(['Age'], dtype='object')

In [24]:
newip.Age.head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [30]:
import math
median_age = df[['Age']].median()

In [33]:
newip[['Age']] = newip[['Age']].fillna(median_age)

In [34]:
newip.Age.head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    28.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [36]:
from sklearn.model_selection import train_test_split

In [37]:
X_train, X_test, Y_train, Y_test = train_test_split(newip, targets, test_size = 0.2)

In [38]:
len(X_train)

712

In [39]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [40]:
model.fit(X_train, Y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [42]:
model.score(X_test, Y_test)

0.7932960893854749

In [43]:
model.predict(X_test[:10])

array([1, 0, 0, 0, 1, 0, 0, 0, 0, 1], dtype=int64)

In [44]:
Y_test[:10]

727    1
13     0
162    0
116    0
404    0
701    1
222    0
397    0
628    0
297    0
Name: Survived, dtype: int64